using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Задача_1._2
{
    class Program
    {
        static void Main(string[] args)
        {
            string a = ("\nКоторая в тёмном чулане хранится\nВ доме,\nКоторый построил Джек.\n\n");
            Console.WriteLine("Самуил Маршак. Дом, который построил Джек.\n\nВот дом,\nКоторый построил Джек.\n\nА это пшеница," + a + "А это весёлая птица-синица,\nКоторая часто ворует пшеницу," + a + "Вот кот,\nКоторый пугает и ловит синицу,\nКоторая часто ворует пшеницу," + a + "Вот пёс без хвоста,\nКоторый за шиворот треплет кота,\nКоторый пугает и ловит синицу,\nКоторая часто ворует пшеницу," + a + "А это корова безрогая,\nЛягнувшая старого пса без хвоста,\nКоторый за шиворот треплет кота,\nКоторый пугает и ловит синицу,\nКоторая часто ворует пшеницу," + a + "А это старушка, седая и строгая,\nКоторая доит корову безрогую,\nЛягнувшую старого пса без хвоста,\nКоторый за шиворот треплет кота,\nКоторый пугает и ловит синицу,\nКоторая часто ворует пшеницу," + a + "А это ленивый и толстый пастух,\nКоторый бранится с коровницей строгою,\nКоторая доит корову безрогую,/nЛягнувшую старого пса без хвоста,\nКоторый за шиворот треплет кота,\nКоторый пугает и ловит синицу,\nКоторая часто ворует пшеницу," + a + "Вот два петуха,\nКоторые будят того пастуха,\nКоторый бранится с коровницей строгою,\nКоторая доит корову безрогую,\nЛягнувшую старого пса без хвоста,\nКоторый за шиворот треплет кота,\nКоторый пугает и ловит синицу,\nКоторая часто ворует пшеницу," + a);
        }
}
